#![allow(unused)]
#![allow(non_snake_case)]

use core_foundation::array::*;
use core_foundation::data::*;
use core_foundation::dictionary::*;
use core_foundation::runloop::*;
use core_foundation::string::*;
use core_foundation::url::*;

#[repr(C)]
pub struct __CFAllocator(::core::ffi::c_void);
#[repr(C)]
pub struct __CFError(::core::ffi::c_void);
#[repr(C)]
pub struct __CFReadStream(::core::ffi::c_void);
#[repr(C)]
pub struct __CFWriteStream(::core::ffi::c_void);
#[repr(C)]
pub struct __CFHost(::core::ffi::c_void);
#[repr(C)]
pub struct __CFNetService(::core::ffi::c_void);
#[repr(C)]
pub struct __CFNetServiceMonitor(::core::ffi::c_void);
#[repr(C)]
pub struct __CFNetServiceBrowser(::core::ffi::c_void);
#[repr(C)]
pub struct __CFHTTPMessage(::core::ffi::c_void);
#[repr(C)]
pub struct _CFHTTPAuthentication(::core::ffi::c_void);
#[repr(C)]
pub struct __CFNetDiagnostic(::core::ffi::c_void);

/* automatically generated by rust-bindgen 0.62.0 */

pub type UInt8 = ::core::ffi::c_uchar;
pub type SInt32 = ::core::ffi::c_int;
pub type Boolean = ::core::ffi::c_uchar;
pub type CFTypeID = ::core::ffi::c_ulong;
pub type CFOptionFlags = ::core::ffi::c_ulong;
pub type CFIndex = ::core::ffi::c_long;
pub type CFTypeRef = *const ::core::ffi::c_void;
pub type CFStringRef = *const __CFString;
pub type CFAllocatorRef = *const __CFAllocator;
pub type CFAllocatorRetainCallBack = ::core::option::Option<
    unsafe extern "C" fn(info: *const ::core::ffi::c_void) -> *const ::core::ffi::c_void,
>;

pub type CFNetServiceMonitorType = ::core::ffi::c_int;
pub type CFNetServiceRegisterFlags = CFOptionFlags;
pub type CFNetServiceBrowserFlags = CFOptionFlags;
pub type CFNetServiceClientCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        theService: CFNetServiceRef,
        error: *mut CFStreamError,
        info: *mut ::core::ffi::c_void,
    ),
>;
pub type CFNetServiceMonitorClientCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        theMonitor: CFNetServiceMonitorRef,
        theService: CFNetServiceRef,
        typeInfo: CFNetServiceMonitorType,
        rdata: CFDataRef,
        error: *mut CFStreamError,
        info: *mut ::core::ffi::c_void,
    ),
>;
pub type CFNetServiceBrowserClientCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        browser: CFNetServiceBrowserRef,
        flags: CFOptionFlags,
        domainOrService: CFTypeRef,
        error: *mut CFStreamError,
        info: *mut ::core::ffi::c_void,
    ),
>;
pub type CFHTTPMessageRef = *mut __CFHTTPMessage;
pub type CFStreamErrorHTTP = ::core::ffi::c_int;
pub type CFHTTPAuthenticationRef = *mut _CFHTTPAuthentication;
pub type CFStreamErrorHTTPAuthentication = ::core::ffi::c_int;
pub type CFNetDiagnosticRef = *mut __CFNetDiagnostic;
pub type CFNetDiagnosticStatusValues = ::core::ffi::c_int;
pub type CFNetDiagnosticStatus = CFIndex;
pub type CFProxyAutoConfigurationResultCallback = ::core::option::Option<
    unsafe extern "C" fn(
        client: *mut ::core::ffi::c_void,
        proxyList: CFArrayRef,
        error: CFErrorRef,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CFStreamError {
    pub domain: CFIndex,
    pub error: SInt32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CFStreamClientContext {
    pub version: CFIndex,
    pub info: *mut ::core::ffi::c_void,
    pub retain: ::core::option::Option<
        unsafe extern "C" fn(info: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
    >,
    pub release: ::core::option::Option<unsafe extern "C" fn(info: *mut ::core::ffi::c_void)>,
    pub copyDescription:
        ::core::option::Option<unsafe extern "C" fn(info: *mut ::core::ffi::c_void) -> CFStringRef>,
}
#[repr(C, packed(2))]
pub struct CFHostClientContext {
    pub version: CFIndex,
    pub info: *mut ::core::ffi::c_void,
    pub retain: CFAllocatorRetainCallBack,
    pub release: CFAllocatorReleaseCallBack,
    pub copyDescription: CFAllocatorCopyDescriptionCallBack,
}
#[repr(C, packed(2))]
pub struct CFNetServiceClientContext {
    pub version: CFIndex,
    pub info: *mut ::core::ffi::c_void,
    pub retain: CFAllocatorRetainCallBack,
    pub release: CFAllocatorReleaseCallBack,
    pub copyDescription: CFAllocatorCopyDescriptionCallBack,
}
#[test]
fn bindgen_test_layout_CFStreamError() {
    const UNINIT: ::core::mem::MaybeUninit<CFStreamError> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CFStreamError>(),
        16usize,
        concat!("Size of: ", stringify!(CFStreamError))
    );
    assert_eq!(
        ::core::mem::align_of::<CFStreamError>(),
        8usize,
        concat!("Alignment of ", stringify!(CFStreamError))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).domain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamError),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).error) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamError),
            "::",
            stringify!(error)
        )
    );
}
#[test]
fn bindgen_test_layout_CFStreamClientContext() {
    const UNINIT: ::core::mem::MaybeUninit<CFStreamClientContext> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CFStreamClientContext>(),
        40usize,
        concat!("Size of: ", stringify!(CFStreamClientContext))
    );
    assert_eq!(
        ::core::mem::align_of::<CFStreamClientContext>(),
        8usize,
        concat!("Alignment of ", stringify!(CFStreamClientContext))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamClientContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamClientContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).retain) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamClientContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).release) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamClientContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).copyDescription) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CFStreamClientContext),
            "::",
            stringify!(copyDescription)
        )
    );
}
#[test]
fn bindgen_test_layout_CFHostClientContext() {
    const UNINIT: ::core::mem::MaybeUninit<CFHostClientContext> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CFHostClientContext>(),
        40usize,
        concat!("Size of: ", stringify!(CFHostClientContext))
    );
    assert_eq!(
        ::core::mem::align_of::<CFHostClientContext>(),
        2usize,
        concat!("Alignment of ", stringify!(CFHostClientContext))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CFHostClientContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CFHostClientContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).retain) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CFHostClientContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).release) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CFHostClientContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).copyDescription) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CFHostClientContext),
            "::",
            stringify!(copyDescription)
        )
    );
}
#[test]
fn bindgen_test_layout_CFNetServiceClientContext() {
    const UNINIT: ::core::mem::MaybeUninit<CFNetServiceClientContext> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<CFNetServiceClientContext>(),
        40usize,
        concat!("Size of: ", stringify!(CFNetServiceClientContext))
    );
    assert_eq!(
        ::core::mem::align_of::<CFNetServiceClientContext>(),
        2usize,
        concat!("Alignment of ", stringify!(CFNetServiceClientContext))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CFNetServiceClientContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CFNetServiceClientContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).retain) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CFNetServiceClientContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).release) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CFNetServiceClientContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).copyDescription) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CFNetServiceClientContext),
            "::",
            stringify!(copyDescription)
        )
    );
}

#[link(name = "CFNetwork", kind = "framework")]
extern "C" {
    pub static kCFErrorDomainCFNetwork: CFStringRef;
    pub static kCFErrorDomainWinSock: CFStringRef;
    pub static kCFURLErrorFailingURLErrorKey: CFStringRef;
    pub static kCFURLErrorFailingURLStringErrorKey: CFStringRef;
    pub static kCFGetAddrInfoFailureKey: CFStringRef;
    pub static kCFSOCKSStatusCodeKey: CFStringRef;
    pub static kCFSOCKSVersionKey: CFStringRef;
    pub static kCFSOCKSNegotiationMethodKey: CFStringRef;
    pub static kCFDNSServiceFailureKey: CFStringRef;
    pub static kCFFTPStatusCodeKey: CFStringRef;
    pub static kCFStreamErrorDomainNetDB: SInt32;
    pub static kCFStreamErrorDomainSystemConfiguration: SInt32;
    pub fn CFHostGetTypeID() -> CFTypeID;
